Repository: 84000/data-translation-memory
Catalog: toh129-v4.tmx
Source language: bo
Languages: en

source: འཕགས་པ་རབ་ཏུ་ཞི་བ་རྣམ་པར་ངེས་པའི་ཆོ་འཕྲུལ་གྱི་ཏིང་ངེ་འཛིན་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Absorption of the Miraculous Ascertainment of Peace

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་པ་ལ་འདི་ལྟ་སྟེ།
en: The Blessed One was dwelling at Rājagṛha on Vulture Peak with a great saṅgha of 1,250 monks as well as bodhisattvas equal in number to the atoms found in one hundred million buddha realms.

source: བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། སྨན་གྱི་རྒྱལ་པོ་དང་། སྨན་ཡང་དག་བྱུང་དང་། སྨན་མངོན་བསྒྲགས་དབྱངས་རྒྱལ་པོ་དང་། ལག་ན་པད་མ་དང་། ཉི་མའི་འོད་དང་། རྡུལ་མེད་རྣམ་པར་གནོན་དང་། ངན་སོང་སྤོང་དང་།
en: Included among them were the bodhisattvas Mañjuśrī Kumārabhūta, Avalokiteśvara, Bhaiṣajyarāja, Genuine Medicine, Famous and Melodious King of Medicine, Padmapāṇi, Sūryaprabha, Stainless Subjugator, and Conqueror of the Lower Realms.

source: ཡེ་ཤེས་བླ་མའི་ཡེ་ཤེས་ལྡན་དང་། རིན་ཆེན་བླ་མའི་ཡེ་ཤེས་ལྡན་དང་། སེམས་ཅན་གྱི་སྐད་ཡེ་ཤེས་ལྡན་དང་། མེ་ཏོག་བླ་མའི་ཡེ་ཤེས་ལྡན་དང་། ཟླ་བའི་བླ་མའི་ཡེ་ཤེས་ལྡན་དང་། དྲི་མ་མེད་པའི་བླ་མའི་ཡེ་ཤེས་ལྡན་དང་། རྡོ་རྗེ་བླ་མའི་ཡེ་ཤེས་ལྡན་དང་། རྡུལ་མེད་བླ་མའི་ཡེ་ཤེས་ལྡན་དང་། རྣམ་པར་སྣང་བྱེད་བླ་མའི་ཡེ་ཤེས་ལྡན་དང་།
en: There were also the bodhisattvas Wise Superior Wisdom, Wise Superior Wealth, Wise Communicator, Wise Superior Flower, Wise Superior Moon, Wise Superior Purity, Wise Superior Vajra, Wise Superior Clarity, and Wise Superior Illuminator.

source: སྐར་མའི་རྒྱལ་མཚན་དང་། རིན་པོ་ཆེའི་རྒྱལ་མཚན་དང་། ལྷུན་པོའི་རྒྱལ་མཚན་དང་། ཆགས་མེད་རྒྱལ་མཚན་དང་། མེ་ཏོག་རྒྱལ་མཚན་དང་། དྲི་མ་མེད་པའི་རྒྱལ་མཚན་དང་། ཉི་མའི་རྒྱལ་མཚན་དང་། མཛེས་པའི་རྒྱལ་མཚན་དང་། རྡུལ་བྲལ་རྒྱལ་མཚན་དང་། རྣམ་པར་སྣང་བྱེད་རྒྱལ་མཚན་དང་། སའི་གཟི་བརྗིད་དང་།
en: There were also the bodhisattvas Victory Banner of the Stars, Jeweled Victory Banner, Victory Banner of Mount Meru, Desireless Victory Banner, Flower Victory Banner, Stainless Victory Banner, Victory Banner of the Sun, Victory Banner of Beauty, Immaculate Victory Banner, and Illuminating Victory Banner.

source: རིན་ཆེན་གཟི་བརྗིད་དང་། བློ་གྲོས་ཆེན་པོའི་གཟི་བརྗིད་དང་། ཡེ་ཤེས་རྡོ་རྗེའི་གཟི་བརྗིད་དང་། དྲི་མ་མེད་པའི་གཟི་བརྗིད་དང་། ཉི་མའི་གཟི་བརྗིད་དང་། བསོད་ནམས་རི་བོའི་གཟི་བརྗིད་དང་། ཡེ་ཤེས་སྣང་བའི་གཟི་བརྗིད་དང་། མཚུངས་མེད་དཔལ་གྱི་གཟི་བརྗིད་དང་།
en: There were also the bodhisattvas Splendor of the Earth, Splendor of Jewels, Splendor of Great Intelligence, Splendor of Vajra Wisdom, Splendor of Purity, Splendor of the Sun, Splendor of Immense Merit, Splendor of Wisdom Light, and Splendor of Unmatched Majesty.

source: སའི་སྙིང་པོ་དང་། ནམ་མཁའི་སྙིང་པོ་དང་། རིན་པོ་ཆེའི་སྙིང་པོ་དང་། པད་མའི་སྙིང་པོ་དང་། ཉི་མའི་སྙིང་པོ་དང་། ཡོན་ཏན་རྣམ་པར་དག་པའི་སྙིང་པོ་དང་། ཆོས་ཀྱི་ཕྱག་རྒྱའི་སྙིང་པོ་དང་། རྣམ་པར་སྣང་བྱེད་ཀྱི་སྙིང་པོ་དང་། ལྟེ་བའི་སྙིང་པོ་དང་། པད་མའི་དཔལ་གྱི་སྙིང་པོ་དང་།
en: There were also the bodhisattvas Kṣitigarbha, Ākāśagarbha, Ratnagarbha, Padmagarbha, Sūryagarbha, Guṇaviśuddhigarbha, Dharmamudrāgarbha, Vairocanagarbha, Nabhigarbha, and Padmaśrīgarbha.

source: ཉི་མའི་མིག་དང་། རྣམ་པར་དག་པ་དྲི་མ་མེད་པའི་མིག་དང་། རྣམ་པར་སངས་པའི་མིག་དང་། ཆགས་པ་མེད་པའི་མིག་དང་། ཀུན་ཏུ་ལྟ་བའི་མིག་དང་། ཤིན་ཏུ་རྣོ་བའི་མིག་དང་། རྡོ་རྗེའི་མིག་དང་། རིན་པོ་ཆེའི་མིག་དང་། ནམ་མཁའི་མིག་དང་། ཀུན་ནས་མིག་དང་།
en: There were also the bodhisattvas Sun Eyes, Pure and Stainless Eyes, Purified Eyes, Desireless Eyes, All-Seeing Eyes, Sharp Eyes, Vajra Eyes, Jewel Eyes, Sky Eyes, and Omnipresent Eyes.

source: ལྷའི་ཅོད་པན་དང་། ཆོས་ཀྱི་དབྱིངས་སྣང་བའི་ནོར་བུའི་ཅོད་པན་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་ཅོད་པན་དང་། རྣམ་པར་སྣང་བྱེད་ཅོད་པན་དང་། སངས་རྒྱས་ཐམས་ཅད་བྱུང་བའི་སྙིང་པོའི་ཅོད་པན་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པའི་ཅོད་པན་དང་། དུས་ཐམས་ཅད་དུ་མངོན་པར་འཕགས་པའི་ཅོད་པན་དང་། ཀུན་ཏུ་རྣམ་པར་སྣང་བྱེད་ཅོད་པན་དང་། ཟིལ་གྱིས་མི་ནོན་པའི་ཅོད་པན་དང་། ཆོས་ཐམས་ཅད་ཀྱི་སྙིང་པོ་དེ་བཞིན་གཤེགས་པའི་སེང་གེའི་ཁྲི་འཛིན་པའི་ཅོད་པན་དང་།
en: There were also the bodhisattvas Divine Crown, Crown of the Jewel That Illuminates the Realm of Phenomena, Crown of the Seat of Enlightenment, Illuminating Crown, Crown of the Womb from Which All Buddhas Are Born, Crown Nobler Than the Cosmos, Ever-Noble Crown, Utterly Illuminating Crown, Crown That Is Never Outshone, Crown That Captures the Thus-Gone Ones’ Lion Throne of the Essence of All Phenomena, and Crown That Fully Illuminates the Space of the Realm of Phenomena.

source: ཀུན་ནས་ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའ་སྣང་བའི་ཅོད་པན་དང་། ཚངས་པའི་དབང་པོའི་གཙུག་པུད་དང་། ཀླུའི་དབང་པོའི་གཙུག་པུད་དང་། སངས་རྒྱས་འཕྲུལ་པ་ཐམས་ཅད་སྣང་བའི་གཙུག་པུད་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་གཙུག་པུད་དང་། སྨོན་ལམ་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་དབྱངས་ནོར་བུ་རིན་ཆེན་རྒྱལ་པོའི་གཙུག་པུད་དང་། དུས་གསུམ་ཐམས་ཅད་ཀུན་ནས་དབྱངས་ཀྱི་གཙུག་པུད་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་རྣམ་པར་འཕྲུལ་པའི་སྣང་བའི་རྒྱལ་མཚན་ནོར་བུའི་རྒྱལ་པོ་ནོར་བུ་རིན་པོ་ཆེའི་དྲ་བས་བྲེས་པའི་གཙུག་པུད་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་དབྱངས་ཀྱི་གཙུག་པུད་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་གཏོང་བ་ནོར་བུ་རིན་པོ་ཆེ་མངོན་པར་བསྒྲགས་པའི་གཙུག་པུད་དང་། ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་དབྱེར་མེད་པ་རྣམ་པར་ཤེས་པའི་ནོར་བུ་རིན་པོ་ཆེས་བརྒྱན་པའི་གཙུག་པུད་དང་།
en: There were also the bodhisattvas Crown Ornament of the Lord of the Brahmā Realm, Crown Ornament of the Nāga Lord, Crown Ornament That Illuminates All the Buddha’s Emanations, Crown Ornament of the Seat of Enlightenment, Crown Ornament of the King of Jewels That Sings an Ocean of Aspirations, Crown Ornament of the Melodious One in All the Three Times, Crown Ornament of the Precious King of Jewels That Is Adorned with a Web of Gems and Placed on the Victory Banner That Illuminates the Emanations of All Thus-Gone Ones, Crown Ornament of the Melodious Dharma Wheel of All Thus-Gone Ones, Crown Ornament of the Brilliant Gem That Projects the Halo of All Thus-Gone Ones, and Crown Ornament Adorned by the Gem That Perceives the Indivisibility of All of Space.

source: འོད་ཆེན་དང་དྲི་མ་མེད་པའི་འོད་དང་། རིན་པོ་ཆེའི་འོད་དང་། རྡུལ་དང་བྲལ་བའི་འོད་དང་། སྣང་བའི་འོད་དང་། ཆོས་ཀྱི་འོད་དང་། ཞི་བའི་འོད་དང་། ཉི་མའི་འོད་དང་། རྣམ་པར་འཕྲུལ་པའི་འོད་དང་། ལྷའི་འོད་དང་། བསོད་ནམས་འོད་དང་།
en: There were also the bodhisattvas Great Light, Stainless Light, Jeweled Light, Immaculate Light, Shining Light, Dharma Light, Peaceful Light, Sūryaprabha, Emanated Light, Divine Light, and Meritorious Light.

source: བསོད་ནམས་ཀྱི་ཏོག་དང་། ཡེ་ཤེས་ཀྱི་ཏོག་དང་། ཆོས་ཀྱི་ཏོག་དང་། མངོན་པར་ཤེས་པའི་ཏོག་དང་། འོད་ཀྱི་ཏོག་དང་། མེ་ཏོག་གི་ཏོག་དང་། ནོར་བུའི་ཏོག་དང་། སངས་རྒྱས་ཀྱི་ཏོག་དང་། ཚངས་པའི་ཏོག་དང་། ཀུན་ནས་སྣང་བའི་ཏོག་དང་།
en: There were also the bodhisattvas Crest of Merit, Crest of Wisdom, Crest of Dharma, Crest of Superknowledge, Crest of Light, Crest of Flowers, Crest of Jewels, Crest of Buddhas, Crest of Brahmā, and Crest of Illumination.

source: ཚངས་པའི་དབྱངས་དང་། སའི་སྒྲ་དབྱངས་དང་། རྒྱ་མཚོའི་དབྱངས་དང་། འཇིག་རྟེན་དབང་པོའི་དབྱངས་དང་། རི་དབང་རྒྱལ་པོ་རྡོབ་པའི་དབྱངས་དང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པའི་དབྱངས་དང་། ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་བསྒྲགས་པའི་དབྱངས་དང་། རྒྱ་མཚོའི་དཀྱིལ་འཁོར་ཐམས་ཅད་རབ་ཏུ་ཀློངས་པའི་དབྱངས་དང་། སྙིང་རྗེ་ཆེན་པོའི་ཚུལ་གྱི་འབྲུག་སྒྲ་བསྒྲགས་པའི་དབྱངས་དང་། འགྲོ་བ་སྡུག་བསྔལ་བ་ཐམས་ཅད་དབུགས་འབྱིན་པའི་དབྱངས་དང་ཆོས་འཕགས་དང་།
en: There were also the bodhisattvas Song of Brahmā, Song of the Earth, Song of the Ocean, Song of the Lord of the World, Song Offering the Royal Lord of Mountains, Song That Pervades the Entire Realm of Phenomena, Song That Sounds the Ocean of Dharma, Song That Stirs All the Oceans, Song of Greatly Compassionate Thunder, and Song That Relieves All the Suffering of Beings.

source: ཁྱད་པར་འཕགས་དང་ཡེ་ཤེས་འཕགས་དང་།བསོད་ནམས་རི་རབ་འཕགས་དང་། ཡོན་ཏན་བསོད་ནམས་འཕགས་དང་། གྲགས་པ་འཕགས་དང་། ཀུན་ནས་སྣང་བ་འཕགས་དང་། བྱམས་པ་ཆེན་པོ་འཕགས་དང་། ཡེ་ཤེས་འབྱུང་བ་འཕགས་དང་། དེ་བཞིན་གཤེགས་པའི་རུས་རིགས་འཕགས་དང་།
en: There were also the bodhisattvas Noble Dharma, Especially Noble, Noble Wisdom, Noble Merit Like Mount Meru, Noble Merit and Qualities, Noble Fame, Noble Illumination, Noble Great Love, Noble Source of Wisdom, and Noble Lineage of the Thus-Gone Ones.

source: སྣང་བའི་དཔལ་དང་། མཆོག་གི་དཔལ་དང་། ཡང་དག་འཕགས་པའི་དཔལ་དང་། རྣམ་པར་སྣང་བྱེད་དཔལ་དང་། ཟླ་བའི་དཔལ་དང་། ཚོགས་ཀྱི་དཔལ་དང་། ནམ་མཁའི་དཔལ་དང་། རིན་པོ་ཆེའི་དཔལ་དང་། ཏོག་གི་དཔལ་དང་། ཡེ་ཤེས་དཔལ་དང་།
en: There were also the bodhisattvas Shining Splendor, Supreme Splendor, Noble Splendor, Illuminating Splendor, Moonlike Splendor, Assembled Splendor, Space-Like Splendor, Jewel Splendor, Highest Splendor, and Wisdom Splendor.

source: སཱ་ལའི་དབང་པོའི་རྒྱལ་པོ་དང་། འགྲོ་བའི་དབང་པོའི་རྒྱལ་པོ་དང་། ཚངས་པའི་དབང་པོའི་རྒྱལ་པོ་དང་། རི་བོའི་དབང་པོའི་རྒྱལ་པོ་དང་། མི་གཡོ་བའི་དབང་པོའི་རྒྱལ་པོ་དང་། ཁྱུ་མཆོག་གི་དབང་པོའི་རྒྱལ་པོ་དང་། བློ་མཆོག་གི་དབང་པོའི་རྒྱལ་པོ་དང་།
en: There were also the bodhisattvas Lordly King of the Sal Tree, Lordly King of Beings, Lordly King of the Brahmā Realm, Lordly King of the Hills, Lordly King of Stillness, Lordly King of the Leaders, and Lordly King of the Great Minds.

source: རབ་ཏུ་ཞི་བའི་ང་རོ་དང་། ཆགས་མེད་ང་རོ་དང་། ས་དབྱངས་ང་རོ་དང་། རྒྱ་མཚོ་འབྲུག་བསྒྲགས་ང་རོ་དང་། སྔོན་གྱི་སྨོན་ལམ་གྱིས་བསྐུར་བའི་ང་རོ་དང་། རྒྱ་མཚོའི་དཀྱིལ་འཁོར་སྒྲའི་ང་རོ་དང་།
en: There were also the bodhisattvas Roar of Peace, Roar of Non-Attachment, Roar of the Earth Tune, Roar of the Ocean Thunder, Roar Invoked by Previous Aspirations, and Roar of the Rumbling Oceans.

source: ཡེ་ཤེས་ལྷུན་པོའི་བློ་དང་། ནམ་མཁའི་བློ་དང་། དྲི་མ་མེད་པའི་བློ་དང་། ཆགས་པ་མེད་པའི་བློ་དང་། རྣམ་པར་སངས་པའི་བློ་དང་། དུས་གསུམ་སྣང་བའི་བློ་དང་། རླབས་པོ་ཆེའི་བློ་དང་། རིན་པོ་ཆེའི་བློ་དང་། ཡངས་པའི་བློ་དང་། ཀུན་ཏུ་ལྟ་བའི་བློ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་སྣང་བའི་བློ་དང་།
en: There were also the bodhisattvas Mind of Immense Wisdom, Mind of Space, Mind of Purity, Mind of Non-Attachment, Mind of Purification, Mind Illuminating the Three Times, Mind of Immense Power, Mind Like Gems, Spacious Mind, All-Seeing Mind, and Mind Illuminating Bodhisattva Great Beings in the Ways of the Realm of Phenomena.

source: དེ་དག་ལ་སོགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་ཀྱང་ཕྱིར་མི་ལྡོག་པ་ནམ་མཁའི་དབྱིངས་ལྟར་ཚད་མེད་པའི་ཆོས་དང་ལྡན་པ།
en: All these bodhisattva great beings, as well as many others equal in number to the atoms found in one hundred million buddha realms, were non-regressing beings who possessed qualities as limitless as the expanse of the sky.

source: ཆོས་ཀྱི་དབྱིངས་སྒྲིབ་པ་མེད་པ་མཉམ་པར་གནས་པ་དང་ལྡན་པ། ཡང་དག་པའི་མཐའ་དང་ཆོས་ཀྱི་དབྱིངས་མཉམ་པ་ཉིད་དང་ལྡན་པ།
en: They could abide in the sameness of the unobscured realm of phenomena and had realized the sameness of the limit of reality and the realm of phenomena.

source: ལས་ལས་ཀུན་ཏུ་འབྱུང་བའི་རྣམ་པར་སྨིན་པ་ཇི་ལྟ་བ་བཞིན་དུ་མོས་པ། རྒྱུ་ལས་ཀུན་ཏུ་འབྱུང་བའི་འབྲས་བུ་ཇི་ལྟ་བ་བཞིན་དུ་མོས་པ། རྒྱའི་འབུར་འབྱུང་བ་ལྟ་བུའི་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་ཤེས་པ་དང་ལྡན་པ།
en: They had conviction in the way in which actions lead to ripening and the way in which results appear based on causes, and they had knowledge of the sameness in which all phenomena are like the emergence of a stamped image.

source: མིག་ཡོར་དང་གཟུགས་བརྙན་ལྟར་སྣང་བའི་ཆོས་མཉམ་པ་ཉིད་དང་ལྡན་པ།
en: They had realized the sameness in which phenomena appear like optical illusions and reflections.

source: སྒྲ་སྐད་རྣམ་པར་རིག་པ། བྲག་ཅ་དང་མཚུངས་པའི་ཆོས་ཐམས་ཅད་དང་ལྡན་པ་ཤ་སྟག་གོ།
en: They had complete knowledge of sound and language and understood that all phenomena are like echoes.

source: །ཐམས་ཅད་ཀྱང་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པ། དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པ།
en: All of them had attained the absorption of inconceivable liberation and the absorption of the heroic stride.

source: སངས་རྒྱས་ཀྱི་སྐུའི་ཁ་དོག་མཐའ་ཡས་པ། ཡོངས་སུ་གྲུབ་པ་སྒྲུབ་པའི་གཟུངས་ལ་རབ་ཏུ་གནས་པ།
en: They had the limitless colors of a buddha’s body and were established in the dhāraṇī that accomplishes the entirely perfect state.

source: སྐྲ་ཙམ་གྱི་ཁྱོན་གཅིག་ལ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀུན་ཏུ་སྟོན་པ་ལ་མཁས་པ།
en: They were skilled in causing all the buddha realms to be seen in the space of a single hair’s breadth.

source: སྐྲ་ཙམ་གྱི་ཁྱོན་གཅིག་ལ་འཆི་འཕོ་དང་། སྐྱེ་བ་དང་ཚེ་དང་མངོན་པར་འབྱུང་བ་དང་དཀའ་བ་སྤྱོད་པ་སྟོན་པ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་དང་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་སྐོར་བ་དང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཀུན་ཏུ་སྟོན་པ།
en: In the space of a single hair’s breadth they could show a buddha’s passing away, taking birth, departing from home, practicing austerities, journeying to the seat of enlightenment, awakening, turning the wheel of Dharma, and passing into nirvāṇa.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་སྐྱིལ་མོ་ཀྲུང་གཅིག་གིས་རྒྱས་པར་འགེངས་པའི་ཡེ་ཤེས་དང་ལྡན་པ།
en: They possessed a wisdom that expanded to pervade the world systems in the ten directions while they remained in one position.

source: ཞིང་ཐམས་ཅད་ཀྱི་རྒྱན་ཞིང་གཅིག་ཏུ་ཀུན་ཏུ་སྟོན་པའི་ཡེ་ཤེས་དང་ལྡན་པ། ཞིང་གཅིག་ཅིག་གི་རྒྱན་བཀོད་པ་ཞིང་ཐམས་ཅད་དུ་སྟོན་པ་དང་ལྡན་པ།
en: They possessed the wisdom that can cause the ornaments of all universes to be seen in a single universe, as well as the wisdom that can cause the ornaments of a single universe to be seen in all universes.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་དེ་བཞིན་གཤེགས་པ་གཅིག་གི་འཁོར་དུ་སྟོན་པ། དེ་བཞིན་གཤེགས་པ་གཅིག་གི་འཁོར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་དུ་སྟོན་པ།
en: They were able to cause the entourage of all thus-gone ones in all the world systems in the ten directions to be seen within the entourage of a single thus-gone one, and they were also able to cause the entourage of a single thus-gone one to be seen in the entourages of all thus-gone ones.

source: ཆོས་ཐམས་ཅད་མཐའ་དང་དབུས་མེད་པར་སྟོན་པ་ལ་མཁས་པ།
en: They were skilled in showing how all phenomena are without center or periphery.

source: ཆོས་ཐམས་ཅད་མཐའ་ཡས་པའི་མཐར་གྱུར་པ།
en: They had reached the end of all limitless phenomena.

source: མཐའ་དང་དབུས་མེད་པ་སྒྱུ་མའི་དྲ་བ་ལྟ་བུར་རབ་ཏུ་སྟོན་པ།
en: They demonstrated the lack of center and periphery to be like an illusory web.

source: བསྐལ་པ་མཐའ་ཡས་མུ་མེད་པར་སེམས་ཅན་ཐམས་ཅད་ཐ་དད་པ་མེད་པར་ཀུན་ཏུ་སྟོན་པ།
en: They caused the lack of any distinctions between sentient beings to be seen throughout limitless eons.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་རང་གི་ལུས་སུ་བྱིན་གྱིས་རློབ་པའི་མོས་པའི་འཇུག་པ་ལ་མཁས་པ།
en: They were skilled in considering the bodies of all beings to be empowered as their own bodies.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྐུ་སྐུ་གཅིག་ཏུ་མོས་པ་འཇུག་པ་ལ་མཁས་པ།
en: They were skilled in considering the bodies of all buddhas to be a single buddha body.

source: སངས་རྒྱས་གཅིག་གི་སྐུ་སངས་རྒྱས་མ་ལུས་པ་ཐམས་ཅད་ཀྱི་སྐུར་འཇུག་པར་སེམས་ཅན་གཞན་ལ་ཀུན་ཏུ་སྟོན་པར་མཁས་པ།
en: They were skilled in causing other beings to see how the body of a single buddha pervades the bodies of all buddhas without exception.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རང་གི་ལུས་ཀུན་ཏུ་སྟོན་པ་ལ་མཁས་པ།
en: They were skilled in causing all world systems in the ten directions to be seen within their own bodies.

source: དུས་གསུམ་ཐམས་ཅད་ཆོས་ཀྱི་སྐུ་གཅིག་གིས་ཁྱབ་པར་སེམས་ཅན་ལ་ཀུན་ཏུ་སྟོན་པ་ལུས་གཅིག་གི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ལ་ལུས་མཐའ་ཡས་པ་ལས་ལྡང་བར་སེམས་ཅན་ལ་ཀུན་ཏུ་སྟོན་པ།
en: They were able to cause beings to see that the single Dharma body pervades the three times. Resting evenly in absorption within a single body, they were able to cause beings to see the act of manifesting limitless bodies.

source: ལུས་གཅིག་གིས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་ལ་སེམས་ཅན་ཐམས་ཅད་སྙེད་ཀྱི་ལུས་ཀུན་ཏུ་སྟོན་པ།
en: Having awakened with one body, they were able to cause as many bodies as there are beings to be seen.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་སེམས་ཅན་གཅིག་གི་ལུས་སུ་ཀུན་ཏུ་སྟོན་པ། སེམས་ཅན་གཅིག་གི་ལུས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་སུ་ཀུན་ཏུ་སྟོན་པ།
en: They were able to cause the bodies of all beings to be seen within the body of a single being, and they were also able to cause the body of a single being to be seen in the bodies of all beings.

source: སེམས་ཅན་གྱི་ལུས་ཆོས་ཀྱི་སྐུར་ཀུན་ཏུ་སྟོན་པ། ཆོས་ཀྱི་སྐུ་སེམས་ཅན་གྱི་ལུས་སུ་སྟོན་པ།
en: They were able to cause the bodies of beings to be seen as the Dharma body, and they were also able to cause the Dharma body to be seen as the bodies of beings.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་རང་གི་སྨོན་ལམ་དུ་བྱིན་གྱིས་རློབ་པ་ལ་མཁས་པ།
en: They were skilled in empowering the aspirations of all bodhisattvas as their own aspirations.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་སངས་རྒྱས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་དང་སྨོན་ལམ་དང་། སྟོབས་དང་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ཀུན་ཏུ་སྟོན་པ།
en: They were able to cause bodhisattvas to see the full awakening of all the buddhas, as well as their aspirations, powers, and full awakening.

source: ཡོངས་སུ་སྨིན་པའི་སེམས་ཅན་ལ་འདུལ་བ་ཇི་ལྟ་བ་བཞིན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀུན་ཏུ་སྟོན་པ།
en: They were able to cause fully mature beings to see their unsurpassed and perfect awakening in whatever ways necessary to train them.

source: བསྐལ་པ་འགྲངས་པ་ཐམས་ཅད་དུ་སྨོན་ལམ་གྱི་རྒྱུན་མི་གཅོད་པ།
en: Their aspirations were uninterrupted throughout all eons.

source: རྣམ་པར་ཤེས་པའི་ལུས་ལས་བསྐྱོད་ནས་ཡེ་ཤེས་ཀྱི་སྐུ་ལ་འཇོག་པར་དབང་བྱེད་པར་སེམས་ཅན་གྱི་ཚོགས་ཐམས་ཅད་ལ་ཀུན་ཏུ་སྟོན་པ།
en: With their mastery in leaving the body of the consciousness and entering the wisdom body they could appear to all the multitudes of beings.

source: རང་གི་ལུས་ཀྱི་རྒྱུན་བཅད་ནས་སེམས་ཅན་གྱི་ཚོགས་གཞན་གྱི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་ཀུན་ཏུ་སྟོན་པ།
en: Having broken the continuity of their own bodies, they appeared for the complete fulfillment of the aspirations of other multitudes of beings.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་སྨོན་ལམ་ལ་འཇུག་པ།
en: They endeavored in aspirations that ripen beings.

source: འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ན་བསྐལ་པ་འགྲངས་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱུན་མི་གཅོད་པ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་སྨོན་ལམ་བཏབ་པའི་སྟོབས་ཀྱིས་སྐྲ་ཙམ་གྱི་ཁྱོན་གཅིག་ལ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རྒྱས་པར་འགེངས་པའི་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པ་ཀུན་ཏུ་སྟོན་པ།
en: As their bodhisattva conduct was uninterrupted throughout all the ages of a single world, the strength of their aspirations directed toward full awakening enabled them to cause indescribably many worlds encompassing all the buddha realms to be seen within the space of a single hair’s breadth.

source: འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཏུ་ལུས་དུ་མ་ཀུན་ཏུ་སྟོན་པ།
en: They were able to cause numerous bodies to be seen within a single world.

source: ཆོས་ཀྱི་ཚིག་གཅིག་བརྗོད་པས་ཆོས་ཀྱི་དབྱིངས་མ་ལུས་པར་རྒྱས་པར་འགེངས་པའི་ཆོས་ཀྱི་སྤྲིན་ཆེན་པོ་ལས་བྱུང་བའི་བདུད་རྩིའི་ཁུ་བའི་ཆར་པ་འབེབས་ལ།
en: By uttering a single word of the Dharma, they would bring down a rain of ambrosia born from great clouds of Dharma that filled the entire realm of phenomena.

source: རིག་པ་དང་རྣམ་པར་གྲོལ་བའི་གློག་བྱུང་ཞིང་ཡང་དག་པ་དེ་ཁོ་ནའི་འབྲུག་བསྒྲགས་པས་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཚིམ་པར་བྱེད་ཅིང་སྨོན་ལམ་ཆེན་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་ཀུན་ཏུ་སྟོན་པ།
en: Through the lightning of intelligence and liberation and the thunder of true reality, they manifested to satisfy all the different kinds of beings and fulfill their great aspirations.

source: བསམ་གཏན་དང་རྣམ་པར་ཐར་པ་དང་མངོན་པར་ཤེས་པ་དང་རིག་པ་དང་ཡེ་ཤེས་ལ་འཇུག་པའི་སྤྱོད་ཡུལ་བ།
en: The field of their experience was to be engaged in concentration, freedom, superknowledge, intelligence, and wisdom.

source: སེམས་བསྐྱེད་པ་གཅིག་གིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་རབ་འབྱམ་ཐམས་ཅད་དུ་འགྲོ་བའི་སྐྱེ་བ་ཐམས་ཅད་དུ་སྐྱེས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཀུན་ཏུ་སྟོན་པ།
en: Through one instance of arousing the mind of awakening, they were able to manifest bodies of all beings born in all possible ways in all the infinite world systems in the ten directions.

source: རང་གི་སེམས་ཤེས་པ་དང་གཞན་གྱི་སེམས་ཤེས་པ་ཆགས་པ་མེད་པས། སེམས་ཅན་གཅིག་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་དང་གཡོ་བ་ཤེས་པ་ལ་མཁས་པ།
en: Since they had no attachment to knowledge of their own or others’ minds, they were proficient in the knowledge of the processes and movements present in a single being’s mind as well as in all beings’ minds.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ་སྐད་ཅིག་གཅིག་གིས་འཇུག་པའི་ཡེ་ཤེས་ལ་མཁས་པ།
en: They were skilled in the wisdom that can engage the ten powers of the thus-gone ones in a single instant.

source: དུས་གསུམ་དུ་གཏོགས་པ་ཐམས་ཅད་ཀྱི་གྲངས་ལ་ཆགས་པ་མེད་པའི་ཡེ་ཤེས་ལ་འཇུག་པ།
en: They were immersed in the wisdom that is not attached to anything whatsoever throughout the three times.

source: སེམས་ཅན་གཞན་གྱི་རྒྱུད་ལ་ཡང་དག་པར་ཐོབ་པར་བྱེད་པའི་ཡེ་ཤེས་ལ་མཁས་པ།
en: They were skilled in the wisdom that brings genuine attainment to the mindstreams of others.

source: སེམས་ཀྱི་སྐད་ཅིག་སེམས་ཀྱི་སྐད་ཅིག་ལ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་རབ་འབྱམ་ཐམས་ཅད་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ཀུན་ཏུ་སྟོན་པ་ལ་མཁས་པ།
en: They were skilled in causing, with a single moment of mind, all beings throughout the infinite expanse of world systems in the ten directions to see complete awakening in a single moment of their minds.

source: སེམས་ཅན་གཅིག་གི་འདུ་ཤེས་ཀྱིས་སེམས་ཅན་མ་ལུས་པ་ཐམས་ཅད་ཀྱི་ལས་ཀྱི་བྱ་བ་ལ་མངོན་སུམ་དུ་འཇུག་པའི་ཡེ་ཤེས་ལ་མཁས་པ།
en: They were skilled in the wisdom capable of using the perception of a single being to engage directly with the karmic actions of all beings without exception.

source: སེམས་ཅན་གཅིག་གི་སྒྲ་སྐད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐད་ལ་འཇུག་པར་སྟོན་པའི་ཡེ་ཤེས་ལ་མཁས་པ།
en: They were skilled in the wisdom that teaches using the languages of all beings through the language of a single being.

source: ལུས་གཅིག་ལ་དམིགས་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ལ་དམིགས་པར་ཀུན་ཏུ་སྟོན་པ་ལ་མཁས་པ།
en: They were skilled in causing the perception of a single body to be seen as the perception of the bodies of all beings.

source: དེ་བཞིན་གཤེགས་པ་གཅིག་གི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་འཇུག་ལ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ན་ཆོས་སྟོན་པ་ཀུན་ཏུ་འཛིན་པ་ལ་མཁས་པ་ཤ་སྟག་གོ།
en: While immersed in the circle of attendants of a single thus-gone one, every one of them was skilled in upholding the teaching of the Dharma within the circle of attendants of all thus-gone ones.

source: །ཐམས་ཅད་ཀྱང་གཟུངས་ཐམས་ཅད་ཐོབ་པ།
en: They had all achieved every dhāraṇī.

source: ཤིན་ཏུ་རྣམ་པར་ངེས་པའི་སྤོབས་པ་སྟོན་ཅིང་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་དབང་པོ་འཛིན་པར་འཇུག་པ་ལ་མཁས་པ།
en: They were skilled in teaching with utterly confident eloquence while understanding the faculties of beings of all dispositions.

source: སེམས་ཅན་གཅིག་གི་སེམས་ལ་དམིགས་པས་བརྗོད་དུ་མེད་པའི་རྒྱུད་དུ་བྱང་ཆུབ་རྣམ་པར་འཚང་རྒྱ་ཞིང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ལ་འཇུག་པའི་ཡེ་ཤེས་ལ་མཁས་པ།
en: They were skilled in the wisdom that, by observing the mind of a single being, can awaken an inexpressible number of mindstreams to buddhahood and thereby engage with the minds of all beings.

source: སྐད་ཅིག་གིས་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་གོ་བར་བྱེད་ཅིང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པའི་རིམ་པ་ཤེས་ལ་སེམས་ཅན་གཞན་གྱི་རྒྱུད་ལ་ཡང་དག་པར་ཐོབ་པར་བྱེད་པའི་ཡེ་ཤེས་ལ་མཁས་པ།
en: They were skilled in the wisdom that instantaneously understands all world systems, knows all the various thoughts of beings, and brings genuine attainment to the mindstreams of others.

source: སྔོན་གྱི་མཐའི་མུའི་བསྐལ་པ་མཐའ་ཡས་པའི་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་བསམ་གྱིས་མི་ཁྱབ་པ་རྗེས་སུ་དྲན་པ་ལ་འཇུག་པས་ལས་དང་བྱ་བ་དང་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་སེམས་ཅན་ལ་སྟོན་ཅིང་སེམས་ཅན་ལ་ཤེས་པར་བྱེད་པ་ལ་མཁས་པ། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་བརྒྱན་པ་ལ་མཁས་པ།
en: By recollecting the inconceivably numerous mind states of all the limitless existences throughout the endless eons of the past, they were skilled in revealing directly to beings how actions and activities ripen into results and in helping them to understand that they were skilled in ornamenting all world systems.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀུན་ཏུ་འཇུག་པ་ལ་མཁས་པ།
en: They were skilled in entering into all world systems.
